articles/2020-08-29-EmacsIDE.org
#+OPTIONS: num:nil toc:nil H:4
#+OPTIONS: html-preamble:nil html-postamble:nil html-scripts:t html-style:nil
#+TITLE: Emacs IDE - Build your own Metals
#+DESCRIPTION: Emacs IDE - Build your own Metals
#+KEYWORDS: Emacs IDE - Build your own Metals
#+CREATOR: Enrico Benini
#+HTML_HEAD_EXTRA: <link rel="shortcut icon" href="../images/favicon.ico" type="image/x-icon">
#+HTML_HEAD_EXTRA: <link rel="icon" href="../images/favicon.ico" type="image/x-icon">
#+HTML_HEAD_EXTRA:  <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.13.0/css/all.min.css">
#+HTML_HEAD_EXTRA:  <link href="https://fonts.googleapis.com/css?family=Montserrat" rel="stylesheet" type="text/css">
#+HTML_HEAD_EXTRA:  <link href="https://fonts.googleapis.com/css?family=Lato" rel="stylesheet" type="text/css">
#+HTML_HEAD_EXTRA: <link href="https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css" rel="stylesheet"/>
#+HTML_HEAD_EXTRA: <script src="https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/js/bootstrap.bundle.min.js"></script>
#+HTML_HEAD_EXTRA:  <link rel="stylesheet" href="../css/main.css">
#+HTML_HEAD_EXTRA:  <link rel="stylesheet" href="../css/blog.css">
#+HTML_HEAD_EXTRA:  <link rel="stylesheet" href="../css/article.css">

* Blog
  :PROPERTIES:
  :HTML_CONTAINER: nav
  :HTML_CONTAINER_CLASS: navbar bg-dark border-bottom border-body navbar-fixed-top navbar-expand-lg bg-body-tertiary
  :CUSTOM_ID: navbar
  :END:
#+CALL: ../templates.org:navbar(1)

* You Don't Need Metals When You Can Build Your Own (Heavy) Metal
  :PROPERTIES:
  :CUSTOM_ID: Article
    :HTML_CONTAINER_CLASS: row
  :END:
  *Created: <2020-08-29 Sat>*
** Abstract
  :PROPERTIES:
  :CUSTOM_ID: ArticleAbstract
  :END:

  Plain emacs is pretty basic, but we all know you can extend it, with
  little effort, to the max.

  This article is about my experience of turning emacs, from a simple
  editor, to something like an IDE. It's still a work in progress as
  always, but it may inspire you into doing the same or pick up some
  ideas from my configuration, extend and make them yours.

  Enjoy 😺

** Content
  :PROPERTIES:
  :CUSTOM_ID: ArticleContent
  :END:

  I am one of those nerds who uses Emacs for pretty much
  everything. I'm not living in it, but I'm not too far from it. One
  of the things I love about it is the possibility to configure it
  as much as you like: creating you own features to extend it.

  I work as a software engineer and, when you deal with code, you
  often need a set of features from your editor (IDE) that speed up
  your productivity by a lot. Nowadays, these features are shipped
  throughout classic IDEs, like IntelliJ or Eclipse, or cross-editor
  extensions, like [[https://scalameta.org/metals/][Metals]] in case of Scala, using the [[https://en.wikipedia.org/wiki/Language_Server_Protocol][Language Server
  Protocol (LSP)]]. Of course, emacs support it as well.

  *However*, installing metals in emacs ended up being a real pain in
  the ass:

  + Having a hard time setting up Doom + Scala (Metals) + Gradle +
    monorepo - ~https://www.reddit.com/r/emacs/comments/idsyxi/having_a_hard_time_setting_up_doom_scala_metals/~
  + [[https://twitter.com/NicolasRinaudo/status/1204143009807425536][Metals in VSCode vs Metals in Emacs]]


  I don't know about the status of it right now. Check on twitter if
  you like.

  At that point, I just told to myself: /Benkio, you know how to code, you can learn and use Elisp, you can virtually implement those features for yourself!/
  And here we are.

** Features
  :PROPERTIES:
  :CUSTOM_ID: ArticleContentFeatures
  :END:

  The features I selected for my work-flow are the following:

  + ~shell-clean-old-output~ :: During development I usually start
       continuous compilation, so I have a background shell printing
       out the compiler output at every change of code (file
       saving). It can be the compiler, the linter or a checker, in
       case of dynamic languages. You name it. In this way, when you
       are ready to deal with errors, you just switch to the shell and
       you see them. However, when you switch to the shell after a
       while, buffer carry the old output results, with errors that
       aren't there anymore. Therefore, I need a command to cleanup
       the shell and leave just the last output, the meaningful one.
  + ~goto-next-warn-error~ :: Once you have the current errors you
       wish to jump to them. Fortunately, pretty much every tool
       provides, as error/warning output: file path, line & column
       number. So, with this command, I put the cursor at the
       beginning of the shell output and it moves the cursor to the
       next location of the error/warnings it encounter, parsing the
       output.
  + ~remove-unused-import~ :: Dependency management is a very useful
       feature of any IDE. When happens to have an import that's not
       used you really wish to get rid of it. This command is built on
       the previous one and it goes and remove it for you. I must say
       it's not always super precise (depends on how you instruct it)
       and it might leave empty lines, but nothing a code formatter,
       like [[https://scalameta.org/scalafmt/][scalafmt]] or [[https://github.com/mihaimaruseac/hindent][hindent]], can't deal with.
  + ~import-type-at-point~ :: The other way around can happen. When
       you have something in your code that's not in scope, so you
       need the right import. This command goes in search of an
       existing import for such object and, if none is found, it goes
       for its definition and build it by itself. Then, the import is
       added to your current file automatically.
  + ~extract-code-line-or-region~ :: A key feature for every
       refactoring maniac, the ability to extract pieces of code to a
       new value or method. it just put the result to the first empty
       line it finds backwards, so you can then move it wherever you
       want, and substitute the code you selected with the name of
       that method/value. It might not be super precise as well, but
       it's a start.

  IDEs have definitely a longer list of features, but I added the most
  important for me. A possible improvement would be to add a command
  for unimplemented methods/values, in case you are creating something
  that should satisfy a specific contract, like a trait/interface/typeclass.

  At the time of writing, I've implemented them for: Haskell, Scala and Typescript.

