articles/2020-08-29-EmacsIDE.html
<!doctype html>
<html lang="en">
<head>
<title>Emacs IDE - Build your own Metals</title>
<!-- 2021-02-01 Mon 14:25 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="benkio">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
<link rel="shortcut icon" href="../../images/favicon.ico" type="image/x-icon">
<link rel="icon" href="../../images/favicon.ico" type="image/x-icon">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.13.0/css/all.min.css">
<link href="https://fonts.googleapis.com/css?family=Montserrat" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Lato" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="../css/main.css">
<link rel="stylesheet" href="../css/blog.css">
<link rel="stylesheet" href="../css/article.css">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#navbar">Blog</a></li>
<li><a href="#Article">You Don't Need Metals When You Can Build Your Own (Heavy) Metal</a>
<ul class="nav">
<li><a href="#ArticleAbstract">Abstract</a></li>
<li><a href="#ArticleContent">Content</a></li>
<li><a href="#ArticleContentFeatures">Features</a></li>
<li><a href="#ArticleContentAbstactPattern">Abstract the Pattern</a>
<ul class="nav">
<li><a href="#ArticleContentAbstactPatternExample">Example</a></li>
</ul>
</li>
<li><a href="#ArticleContentLanguageSpecific">Language Specific</a>
<ul class="nav">
<li><a href="#ArticleContentLanguageSpecificExample">Example</a></li>
</ul>
</li>
<li><a href="#ArticleConclusions">Conclusions</a>
<ul class="nav">
<li><a href="#sec-">References</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#ShareButtons">Share Buttons</a></li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">Emacs IDE - Build your own Metals</h1>

<div id="outline-container-navbar" class="outline-2 text-center navbar navbar-inverse navbar-fixed-top">
<h2 id="navbar"><a id="sec-" name="sec-"></a>Blog</h2>
<div class="outline-text-2" id="text-navbar">
<button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#collapsableNavbar">
  <span class="icon-bar"Article 6</span>
  <span class="icon-bar"></span>
  <span class="icon-bar"></span>
</button>
<a title="Home" href="../blog.html"><h1 id="navbartitle" class="navbar-text">Blog</h1></a>
<div class="collapse navbar-collapse" id="collapsableNavbar">
  <ul class="nav navbar-nav">
    <li><a title="Home" href="../index.html"><i class="fas fa-home fa-3x" aria-hidden="true"></i></a></li>
    <li><a title="Article List" href="../articleList.html" class="navbar-text h3">Article List</a></li>
<li><a title="Book List" href="../bookList.html" class="navbar-text h3">Book List</a></li>
<li><a title="Album List" href="../albumList.html" class="navbar-text h3">Album List</a></li>
  </ul>
</div>
</div>
</div>

<div id="outline-container-Article" class="outline-2">
<h2 id="Article"><a id="sec-" name="sec-"></a>You Don't Need Metals When You Can Build Your Own (Heavy) Metal</h2>
<div class="outline-text-2" id="text-Article">
<p>
<b>Created: <span class="timestamp-wrapper"><span class="timestamp">&lt;2020-08-29 Sat&gt;</span></span></b>
</p>
</div>
<div id="outline-container-ArticleAbstract" class="outline-3">
<h3 id="ArticleAbstract"><a id="sec-" name="sec-"></a>Abstract</h3>
<div class="outline-text-3" id="text-ArticleAbstract">
<p>
Plain emacs is pretty basic, but we all know you can extend it, with
little effort, to the max.
</p>

<p>
This article is about my experience of turning emacs, from a simple
editor, to something like an IDE. It's still a work in progress as
always, but it may inspire you into doing the same or pick up some
ideas from my configuration, extend and make them yours.
</p>

<p>
Enjoy 😺
</p>
</div>
</div>

<div id="outline-container-ArticleContent" class="outline-3">
<h3 id="ArticleContent"><a id="sec-" name="sec-"></a>Content</h3>
<div class="outline-text-3" id="text-ArticleContent">
<p>
I am one of those nerds who uses Emacs for pretty much
everything. I'm not living in it, but I'm not too far from it. One
of the things I love about it is the possibility to configure it
as much as you like: creating you own features to extend it.
</p>

<p>
I work as a software engineer and, when you deal with code, you
often need a set of features from your editor (IDE) that speed up
your productivity by a lot. Nowadays, these features are shipped
throughout classic IDEs, like IntelliJ or Eclipse, or cross-editor
extensions, like <a href="https://scalameta.org/metals/">Metals</a> in case of Scala, using the <a href="https://en.wikipedia.org/wiki/Language_Server_Protocol">Language Server
Protocol (LSP)</a>. Of course, emacs support it as well.
</p>

<p>
<b>However</b>, installing metals in emacs ended up being a real pain in
the ass:
</p>

<ul class="org-ul">
<li><a href="https://www.reddit.com/r/emacs/comments/idsyxi/having_a_hard_time_setting_up_doom_scala_metals/">Having a hard time setting up Doom + Scala (Metals) + Gradle +
monorepo</a>
</li>
<li><a href="https://twitter.com/NicolasRinaudo/status/1204143009807425536">Metals in VSCode vs Metals in Emacs</a>
</li>
</ul>


<p>
I don't know about the status of it right now. Check on twitter if
you like.
</p>

<p>
At that point, I just told to myself: <i>Benkio, you know how to code, you can learn and use Elisp, you can virtually implement those features for yourself!</i>
And here we are.
</p>
</div>
</div>

<div id="outline-container-ArticleContentFeatures" class="outline-3">
<h3 id="ArticleContentFeatures"><a id="sec-" name="sec-"></a>Features</h3>
<div class="outline-text-3" id="text-ArticleContentFeatures">
<p>
The features I selected for my work-flow are the following:
</p>

<dl class="org-dl">
<dt> <code>shell-clean-old-output</code> </dt><dd>During development I usually start
continuous compilation, so I have a background shell printing
out the compiler output at every change of code (file
saving). It can be the compiler, the linter or a checker, in
case of dynamic languages. You name it. In this way, when you
are ready to deal with errors, you just switch to the shell and
you see them. However, when you switch to the shell after a
while, buffer carry the old output results, with errors that
aren't there anymore. Therefore, I need a command to cleanup
the shell and leave just the last output, the meaningful one.
</dd>
<dt> <code>goto-next-warn-error</code> </dt><dd>Once you have the current errors you
wish to jump to them. Fortunately, pretty much every tool
provides, as error/warning output: file path, line &amp; column
number. So, with this command, I put the cursor at the
beginning of the shell output and it moves the cursor to the
next location of the error/warnings it encounter, parsing the
output.
</dd>
<dt> <code>remove-unused-import</code> </dt><dd>Dependency management is a very useful
feature of any IDE. When happens to have an import that's not
used you really wish to get rid of it. This command is built on
the previous one and it goes and remove it for you. I must say
it's not always super precise (depends on how you instruct it)
and it might leave empty lines, but nothing a code formatter,
like <a href="https://scalameta.org/scalafmt/">scalafmt</a> or <a href="https://github.com/mihaimaruseac/hindent">hindent</a>, can't deal with.
</dd>
<dt> <code>import-type-at-point</code> </dt><dd>The other way around can happen. When
you have something in your code that's not in scope, so you
need the right import. This command goes in search of an
existing import for such object and, if none is found, it goes
for its definition and build it by itself. Then, the import is
added to your current file automatically.
</dd>
<dt> <code>extract-code-line-or-region</code> </dt><dd>A key feature for every
refactoring maniac, the ability to extract pieces of code to a
new value or method. it just put the result to the first empty
line it finds backwards, so you can then move it wherever you
want, and substitute the code you selected with the name of
that method/value. It might not be super precise as well, but
it's a start.
</dd>
</dl>

<p>
IDEs have definitely a longer list of features, but I added the most
important for me. A possible improvement would be to add a command
for unimplemented methods/values, in case you are creating something
that should satisfy a specific contract, like a trait/interface/typeclass.
</p>

<p>
At the time of writing, I've implemented them for: Haskell, Scala and Typescript.
</p>
</div>
</div>
