articles/2020-08-29-EmacsIDE.org
** Abstract the Pattern
  :PROPERTIES:
  :CUSTOM_ID: ArticleContentAbstactPattern
  :END:

  The previous section is my /Letter of Intent/ about what I need and
  I want to do, but the number of languages out there are
  countless. Do I need to implement the same exact features countless
  times (or at least for every language I'm interested in) over and
  over again??

  Answer: *Yes and No* 😄

  Every language/tool out there has different syntax, so we need to add
  some specific logic to each one of them. Luckily, there are
  operations that are common whatever the technology, such as copying the
  resulting import to the starting file or copying the extract code to
  the nearest available position. How can we factor out these
  operations and share them between the specific implementations?

  Answer: *Higher-order Functions*

  We can have common patterns/templates for the features that get, as arguments,
  the language-specific functions and apply them accordingly.

*** Example
  :PROPERTIES:
  :CUSTOM_ID: ArticleContentAbstactPatternExample
  :END:

  I will show you how the higher-order function behind
  the feature ~extract-code-line-or-region~ is built.

  #+BEGIN_SRC emacs-lisp
  (defun extract-code-line-or-region-template (value function postDefinitionSyntaxValue postDefinitionSyntaxFunc EndSyntaxValue EndSyntaxFunc name parameters from to)
    "Template for extracting code to value or function:
     Based on the input it this extract the selected code to the closest empty line above.
     - Value: syntax for values in target laguage
     - function: syntax for function in target laguage
     - postDefinitionSyntax: what you put between the name + parameters and the body of the function/value. eg (= in scala)
     - EndSyntax: what to put at the end of the definition of value/function body. Eg in js it's ';' for value but '}' for functionsxs
     - name: name of the extracted value/function
     - from: start of the region
     - to: end of the region
    "
    ;; extract code, cut if region or cut from point to end of the line
    (setq code (buffer-substring from to))
    (delete-region from to)

    ;; Generate code
    (setq resultDefinition (if (string-blank-p parameters)
                               (concat value name postDefinitionSyntaxValue code EndSyntaxValue)
                             (concat function name parameters postDefinitionSyntaxFunc code EndSyntaxFunc)))
    (setq resultReference (if (string-blank-p parameters)
                              name
                            (concat name parameters)))
    ;; Put the resultReference at point
    (insert resultReference)
    ;; Move to the closest ^$ line and insert the resultDefinition
    (re-search-backward "^$")
    (insert resultDefinition)
    )
  #+END_SRC

  The first thing you notice is how this function takes a lot of
  parameters. That's due to his nature of higher order function, since
  it needs to apply the language specific functions in input and
  change its behavior based on the values it gets.

  These are the operations performed:
  - Grabs the code to extract and delete the region selected.
  - Compose the input values to create the extracted code and the
    related reference. It choose if it will be a value of a method
    based on the presence of parameters.
  - Insert the reference where there was the code.
  - Search back for the first empty line.
  - Insert the computed value, method.


    Notice how there's no reference about a specific language syntax
    into this function.

** Language Specific
  :PROPERTIES:
  :CUSTOM_ID: ArticleContentLanguageSpecific
  :END:

  Now that we have templates to use, we can focus on crafting the
  language specific functions to pass into the templates. Most of the
  time, them rely on Regexp to instruct: what to search for or what is
  the right syntax of an import for instance. Of course, some are more
  complex then other and can be quite tricky to set them
  properly. Plus, sometimes you need to override a specific template function
  because the target language is quite /special/.

