articles/2020-08-29-EmacsIDE.html

<div id="outline-container-ArticleContentAbstactPattern" class="outline-3">
<h3 id="ArticleContentAbstactPattern"><a id="sec-" name="sec-"></a>Abstract the Pattern</h3>
<div class="outline-text-3" id="text-ArticleContentAbstactPattern">
<p>
The previous section is my <i>Letter of Intent</i> about what I need and
I want to do, but the number of languages out there are
countless. Do I need to implement the same exact features countless
times (or at least for every language I'm interested in) over and
over again??
</p>

<p>
Answer: <b>Yes and No</b> 😄
</p>

<p>
Every language/tool out there has different syntax, so we need to add
some specific logic to each one of them. Luckily, there are
operations that are common whatever the technology, such as copying the
resulting import to the starting file or copying the extract code to
the nearest available position. How can we factor out these
operations and share them between the specific implementations?
</p>

<p>
Answer: <b>Higher-order Functions</b>
</p>

<p>
We can have common patterns/templates for the features that get, as arguments,
the language-specific functions and apply them accordingly.
</p>
</div>

<div id="outline-container-ArticleContentAbstactPatternExample" class="outline-4">
<h4 id="ArticleContentAbstactPatternExample"><a id="sec-" name="sec-"></a>Example</h4>
<div class="outline-text-4" id="text-ArticleContentAbstactPatternExample">
<p>
I will show you how the higher-order function behind
the feature <code>extract-code-line-or-region</code> is built.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">extract-code-line-or-region-template</span> (value function postDefinitionSyntaxValue postDefinitionSyntaxFunc EndSyntaxValue EndSyntaxFunc name parameters from to)
  <span style="color: #ffa07a;">"Template</span> <span style="color: #ffa07a;">for</span> <span style="color: #ffa07a;">extracting</span> <span style="color: #ffa07a;">code</span> <span style="color: #ffa07a;">to</span> <span style="color: #ffa07a;">value</span> <span style="color: #ffa07a;">or</span> <span style="color: #ffa07a;">function:</span>
   <span style="color: #ffa07a;">Based</span> <span style="color: #ffa07a;">on</span> <span style="color: #ffa07a;">the</span> <span style="color: #ffa07a;">input</span> <span style="color: #ffa07a;">it</span> <span style="color: #ffa07a;">this</span> <span style="color: #ffa07a;">extract</span> <span style="color: #ffa07a;">the</span> <span style="color: #ffa07a;">selected</span> <span style="color: #ffa07a;">code</span> <span style="color: #ffa07a;">to</span> <span style="color: #ffa07a;">the</span> <span style="color: #ffa07a;">closest</span> <span style="color: #ffa07a;">empty</span> <span style="color: #ffa07a;">line</span> <span style="color: #ffa07a;">above.</span>
   <span style="color: #ffa07a;">-</span> <span style="color: #ffa07a;">Value:</span> <span style="color: #ffa07a;">syntax</span> <span style="color: #ffa07a;">for</span> <span style="color: #ffa07a;">values</span> <span style="color: #ffa07a;">in</span> <span style="color: #ffa07a;">target</span> <span style="color: #ffa07a;">laguage</span>
   <span style="color: #ffa07a;">-</span> <span style="color: #ffa07a;">function:</span> <span style="color: #ffa07a;">syntax</span> <span style="color: #ffa07a;">for</span> <span style="color: #ffa07a;">function</span> <span style="color: #ffa07a;">in</span> <span style="color: #ffa07a;">target</span> <span style="color: #ffa07a;">laguage</span>
   <span style="color: #ffa07a;">-</span> <span style="color: #ffa07a;">postDefinitionSyntax:</span> <span style="color: #ffa07a;">what</span> <span style="color: #ffa07a;">you</span> <span style="color: #ffa07a;">put</span> <span style="color: #ffa07a;">between</span> <span style="color: #ffa07a;">the</span> <span style="color: #ffa07a;">name</span> <span style="color: #ffa07a;">+</span> <span style="color: #ffa07a;">parameters</span> <span style="color: #ffa07a;">and</span> <span style="color: #ffa07a;">the</span> <span style="color: #ffa07a;">body</span> <span style="color: #ffa07a;">of</span> <span style="color: #ffa07a;">the</span> <span style="color: #ffa07a;">function/value.</span> <span style="color: #ffa07a;">eg</span> <span style="color: #ffa07a;">(=</span> <span style="color: #ffa07a;">in</span> <span style="color: #ffa07a;">scala)</span>
   <span style="color: #ffa07a;">-</span> <span style="color: #ffa07a;">EndSyntax:</span> <span style="color: #ffa07a;">what</span> <span style="color: #ffa07a;">to</span> <span style="color: #ffa07a;">put</span> <span style="color: #ffa07a;">at</span> <span style="color: #ffa07a;">the</span> <span style="color: #ffa07a;">end</span> <span style="color: #ffa07a;">of</span> <span style="color: #ffa07a;">the</span> <span style="color: #ffa07a;">definition</span> <span style="color: #ffa07a;">of</span> <span style="color: #ffa07a;">value/function</span> <span style="color: #ffa07a;">body.</span> <span style="color: #ffa07a;">Eg</span> <span style="color: #ffa07a;">in</span> <span style="color: #ffa07a;">js</span> <span style="color: #ffa07a;">it's</span> <span style="color: #ffa07a;">';'</span> <span style="color: #ffa07a;">for</span> <span style="color: #ffa07a;">value</span> <span style="color: #ffa07a;">but</span> <span style="color: #ffa07a;">'}'</span> <span style="color: #ffa07a;">for</span> <span style="color: #ffa07a;">functionsxs</span>
   <span style="color: #ffa07a;">-</span> <span style="color: #ffa07a;">name:</span> <span style="color: #ffa07a;">name</span> <span style="color: #ffa07a;">of</span> <span style="color: #ffa07a;">the</span> <span style="color: #ffa07a;">extracted</span> <span style="color: #ffa07a;">value/function</span>
   <span style="color: #ffa07a;">-</span> <span style="color: #ffa07a;">from:</span> <span style="color: #ffa07a;">start</span> <span style="color: #ffa07a;">of</span> <span style="color: #ffa07a;">the</span> <span style="color: #ffa07a;">region</span>
   <span style="color: #ffa07a;">-</span> <span style="color: #ffa07a;">to:</span> <span style="color: #ffa07a;">end</span> <span style="color: #ffa07a;">of</span> <span style="color: #ffa07a;">the</span> <span style="color: #ffa07a;">region</span>
  <span style="color: #ffa07a;">"</span>
  <span style="color: #ff7f24;">;;</span> <span style="color: #ff7f24;">extract</span> <span style="color: #ff7f24;">code,</span> <span style="color: #ff7f24;">cut</span> <span style="color: #ff7f24;">if</span> <span style="color: #ff7f24;">region</span> <span style="color: #ff7f24;">or</span> <span style="color: #ff7f24;">cut</span> <span style="color: #ff7f24;">from</span> <span style="color: #ff7f24;">point</span> <span style="color: #ff7f24;">to</span> <span style="color: #ff7f24;">end</span> <span style="color: #ff7f24;">of</span> <span style="color: #ff7f24;">the</span> <span style="color: #ff7f24;">line</span>
  (<span style="color: #00ffff;">setq</span> code (buffer-substring from to))
  (delete-region from to)

  <span style="color: #ff7f24;">;;</span> <span style="color: #ff7f24;">Generate</span> <span style="color: #ff7f24;">code</span>
  (<span style="color: #00ffff;">setq</span> resultDefinition (<span style="color: #00ffff;">if</span> (string-blank-p parameters)
                             (concat value name postDefinitionSyntaxValue code EndSyntaxValue)
                           (concat function name parameters postDefinitionSyntaxFunc code EndSyntaxFunc)))
  (<span style="color: #00ffff;">setq</span> resultReference (<span style="color: #00ffff;">if</span> (string-blank-p parameters)
                            name
                          (concat name parameters)))
  <span style="color: #ff7f24;">;;</span> <span style="color: #ff7f24;">Put</span> <span style="color: #ff7f24;">the</span> <span style="color: #ff7f24;">resultReference</span> <span style="color: #ff7f24;">at</span> <span style="color: #ff7f24;">point</span>
  (insert resultReference)
  <span style="color: #ff7f24;">;;</span> <span style="color: #ff7f24;">Move</span> <span style="color: #ff7f24;">to</span> <span style="color: #ff7f24;">the</span> <span style="color: #ff7f24;">closest</span> <span style="color: #ff7f24;">^$</span> <span style="color: #ff7f24;">line</span> <span style="color: #ff7f24;">and</span> <span style="color: #ff7f24;">insert</span> <span style="color: #ff7f24;">the</span> <span style="color: #ff7f24;">resultDefinition</span>
  (re-search-backward <span style="color: #ffa07a;">"^$"</span>)
  (insert resultDefinition)
  )
</pre>
</div>

<p>
The first thing you notice is how this function takes a lot of
parameters. That's due to his nature of higher order function, since
it needs to apply the language specific functions in input and
change its behavior based on the values it gets.
</p>

<p>
These are the operations performed:
</p>
<ul class="org-ul">
<li>Grabs the code to extract and delete the region selected.
</li>
<li>Compose the input values to create the extracted code and the
related reference. It choose if it will be a value of a method
based on the presence of parameters.
</li>
<li>Insert the reference where there was the code.
</li>
<li>Search back for the first empty line.
</li>
<li>Insert the computed value, method.
</li>
</ul>


<p>
Notice how there's no reference about a specific language syntax
into this function.
</p>
</div>
</div>
</div>

<div id="outline-container-ArticleContentLanguageSpecific" class="outline-3">
<h3 id="ArticleContentLanguageSpecific"><a id="sec-" name="sec-"></a>Language Specific</h3>
<div class="outline-text-3" id="text-ArticleContentLanguageSpecific">
<p>
Now that we have templates to use, we can focus on crafting the
language specific functions to pass into the templates. Most of the
time, them rely on Regexp to instruct: what to search for or what is
the right syntax of an import for instance. Of course, some are more
complex then other and can be quite tricky to set them
properly. Plus, sometimes you need to override a specific template function
because the target language is quite <i>special</i>.
</p>
</div>
