articles/2020-08-29-EmacsIDE.org
*** Example
  :PROPERTIES:
  :CUSTOM_ID: ArticleContentLanguageSpecificExample
  :END:

  Still using the ~extract-code-line-or-region-template~ but the
  Haskell version

  #+BEGIN_SRC emacs-lisp
  (defun hs-extract-code-line-or-region (name &optional parameters from to)
    "Extract the code to val or def:
     Require:
       - Name of the val/def
       - Optional list of parameters (if empty it will be a val)

     if no code region is selected then it extracts the rest of the line from current position
     Return type not specified.
    "
    (interactive (list
                  (read-string "value/function name: " )
                  (progn
                    (setq
                     param (read-string "param name (RET to finish): ")
                     params nil
                     )
                    (while (not (equal "" (s-trim param)))
                      (push (s-trim param) params)
                      (setq param (read-string "param name (RET to finish): "))
                      )
                    (concat " " (mapconcat 'identity (reverse params) " "))
                    )
                  (if (use-region-p) (region-beginning) (point))
                  (if (use-region-p) (region-end) (line-end-position))
                  ))
    (funcall 'extract-code-line-or-region-template "" "" " = " " = " "" "" name parameters from to)
    )
  #+END_SRC

  Here, the most part of the function is about fetching the input. In
  particular:
  - The name of the outcome value/method.
  - The list of parameters. See how it loops until the user inserts the
    empty string.
  - The region, if present, Otherwise a new region is taken, starting
    from the current position to the end of the line.


  After all the inputs are set, the function just calls the relative
  template function, passing some constants, where the language-syntax
  specific is required, and the variables, where the values are driven
  by the input.  Here you can see how most of the constants are empty
  strings since Haskell has a very concise syntax compared to other
  languages like Scala or Typescript.

** Conclusions
  :PROPERTIES:
  :CUSTOM_ID: ArticleConclusions
  :END:

  Usually, you write the conclusions at the end of the article, but in
  this case, I already know what to write in here, so I have written
  these sections pretty much at the beginning of the article.

  There's a high chance that [[https://scalameta.org/metals/][Metals]], or something similar, now works
  flawlessly and it's easy to install. So, my recommendation is to use
  it, the less configuration you have in place, the better.

  By the way, this was a very cool exercise to do and it's easy to
  remove because they are just a bunch of (almost) stand-alone
  functions. Plus, right now they aren't perfect, but knowing that you
  could change them and make them work better is reassuring.

  In summary, if you want to really make a difference and improve the
  state of software, don't code for your own configuration, but go and
  contribute to those projects to make them better.

  PS: basically, every conclusion I make at the end of my articles is
  something like. Don't do what you just read!. 😄

*** References

    - [[https://github.com/benkio/emacs-config/blob/master/config.org][Emacs configuration]]
    - [[https://github.com/benkio/emacs-config/blob/master/config.org?plain=1#L2099][Template Functions]]
    - [[https://github.com/benkio/emacs-config/blob/master/config.org?plain=1#L2324][Scala Functions]]
    - [[https://github.com/benkio/emacs-config/blob/master/config.org?plain=1#L2519][Haskell Functions]]
    - [[https://github.com/benkio/emacs-config/blob/master/config.org?plain=1#L2735][Typescript Functions]]

* Share Buttons
  :PROPERTIES:
  :CUSTOM_ID: ShareButtons
    :HTML_CONTAINER_CLASS: row
  :END:
#+BEGIN_EXPORT html
<!-- AddToAny BEGIN -->
<hr>
<div class="a2a_kit a2a_kit_size_32 a2a_default_style">
<a class="a2a_dd" href="https://www.addtoany.com/share"></a>
<a class="a2a_button_facebook"></a>
<a class="a2a_button_twitter"></a>
<a class="a2a_button_whatsapp"></a>
<a class="a2a_button_telegram"></a>
<a class="a2a_button_linkedin"></a>
<a class="a2a_button_email"></a>
</div>
<script async src="https://static.addtoany.com/menu/page.js"></script>
<!-- AddToAny END -->
#+END_EXPORT

#+begin_export html
<script type="text/javascript">
$(function() {
  $('#text-table-of-contents > ul li').first().css("display", "none");
  $('#text-table-of-contents > ul li').last().css("display", "none");
  $('#table-of-contents').addClass("visible-lg")
});
  document.getElementById("content").classList.add("container-fluid","p-0");
  document.getElementById("text-navbar").classList.add("container-fluid");
  document.getElementById("outline-container-navbar").setAttribute("data-bs-theme", "dark");
  document.getElementById("text-Article").classList.add("text-center");
  $('.outline-3').addClass("m-auto").addClass("col-md-10");
  document.getElementById("text-ShareButtons").classList.add("m-auto", "col-md-10");
</script>
#+end_export
#+INCLUDE: ../Fragments/disqusFragment.html export html
