articles/2020-08-29-EmacsIDE.html

<div id="outline-container-ArticleContentLanguageSpecificExample" class="outline-4">
<h4 id="ArticleContentLanguageSpecificExample"><a id="sec-" name="sec-"></a>Example</h4>
<div class="outline-text-4" id="text-ArticleContentLanguageSpecificExample">
<p>
Still using the <code>extract-code-line-or-region-template</code> but the
Haskell version
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">hs-extract-code-line-or-region</span> (name <span style="color: #98fb98;">&amp;optional</span> parameters from to)
  <span style="color: #ffa07a;">"Extract</span> <span style="color: #ffa07a;">the</span> <span style="color: #ffa07a;">code</span> <span style="color: #ffa07a;">to</span> <span style="color: #ffa07a;">val</span> <span style="color: #ffa07a;">or</span> <span style="color: #ffa07a;">def:</span>
   <span style="color: #ffa07a;">Require:</span>
     <span style="color: #ffa07a;">-</span> <span style="color: #ffa07a;">Name</span> <span style="color: #ffa07a;">of</span> <span style="color: #ffa07a;">the</span> <span style="color: #ffa07a;">val/def</span>
     <span style="color: #ffa07a;">-</span> <span style="color: #ffa07a;">Optional</span> <span style="color: #ffa07a;">list</span> <span style="color: #ffa07a;">of</span> <span style="color: #ffa07a;">parameters</span> <span style="color: #ffa07a;">(if</span> <span style="color: #ffa07a;">empty</span> <span style="color: #ffa07a;">it</span> <span style="color: #ffa07a;">will</span> <span style="color: #ffa07a;">be</span> <span style="color: #ffa07a;">a</span> <span style="color: #ffa07a;">val)</span>

   <span style="color: #ffa07a;">if</span> <span style="color: #ffa07a;">no</span> <span style="color: #ffa07a;">code</span> <span style="color: #ffa07a;">region</span> <span style="color: #ffa07a;">is</span> <span style="color: #ffa07a;">selected</span> <span style="color: #ffa07a;">then</span> <span style="color: #ffa07a;">it</span> <span style="color: #ffa07a;">extracts</span> <span style="color: #ffa07a;">the</span> <span style="color: #ffa07a;">rest</span> <span style="color: #ffa07a;">of</span> <span style="color: #ffa07a;">the</span> <span style="color: #ffa07a;">line</span> <span style="color: #ffa07a;">from</span> <span style="color: #ffa07a;">current</span> <span style="color: #ffa07a;">position</span>
   <span style="color: #ffa07a;">Return</span> <span style="color: #ffa07a;">type</span> <span style="color: #ffa07a;">not</span> <span style="color: #ffa07a;">specified.</span>
  <span style="color: #ffa07a;">"</span>
  (<span style="color: #00ffff;">interactive</span> (list
                (read-string <span style="color: #ffa07a;">"value/function</span> <span style="color: #ffa07a;">name:</span> <span style="color: #ffa07a;">"</span> )
                (<span style="color: #00ffff;">progn</span>
                  (<span style="color: #00ffff;">setq</span>
                   param (read-string <span style="color: #ffa07a;">"param</span> <span style="color: #ffa07a;">name</span> <span style="color: #ffa07a;">(RET</span> <span style="color: #ffa07a;">to</span> <span style="color: #ffa07a;">finish):</span> <span style="color: #ffa07a;">"</span>)
                   params nil
                   )
                  (<span style="color: #00ffff;">while</span> (not (equal <span style="color: #ffa07a;">""</span> (s-trim param)))
                    (<span style="color: #00ffff;">push</span> (s-trim param) params)
                    (<span style="color: #00ffff;">setq</span> param (read-string <span style="color: #ffa07a;">"param</span> <span style="color: #ffa07a;">name</span> <span style="color: #ffa07a;">(RET</span> <span style="color: #ffa07a;">to</span> <span style="color: #ffa07a;">finish):</span> <span style="color: #ffa07a;">"</span>))
                    )
                  (concat <span style="color: #ffa07a;">"</span> <span style="color: #ffa07a;">"</span> (mapconcat 'identity (reverse params) <span style="color: #ffa07a;">"</span> <span style="color: #ffa07a;">"</span>))
                  )
                (<span style="color: #00ffff;">if</span> (use-region-p) (region-beginning) (point))
                (<span style="color: #00ffff;">if</span> (use-region-p) (region-end) (line-end-position))
                ))
  (funcall 'extract-code-line-or-region-template <span style="color: #ffa07a;">""</span> <span style="color: #ffa07a;">""</span> <span style="color: #ffa07a;">"</span> <span style="color: #ffa07a;">=</span> <span style="color: #ffa07a;">"</span> <span style="color: #ffa07a;">"</span> <span style="color: #ffa07a;">=</span> <span style="color: #ffa07a;">"</span> <span style="color: #ffa07a;">""</span> <span style="color: #ffa07a;">""</span> name parameters from to)
  )
</pre>
</div>

<p>
Here, the most part of the function is about fetching the input. In
particular:
</p>
<ul class="org-ul">
<li>The name of the outcome value/method.
</li>
<li>The list of parameters. See how it loops until the user inserts the
empty string.
</li>
<li>The region, if present, Otherwise a new region is taken, starting
from the current position to the end of the line.
</li>
</ul>


<p>
After all the inputs are set, the function just calls the relative
template function, passing some constants, where the language-syntax
specific is required, and the variables, where the values are driven
by the input.  Here you can see how most of the constants are empty
strings since Haskell has a very concise syntax compared to other
languages like Scala or Typescript.
</p>
</div>
</div>
</div>

<div id="outline-container-ArticleConclusions" class="outline-3">
<h3 id="ArticleConclusions"><a id="sec-" name="sec-"></a>Conclusions</h3>
<div class="outline-text-3" id="text-ArticleConclusions">
<p>
Usually, you write the conclusions at the end of the article, but in
this case, I already know what to write in here, so I have written
these sections pretty much at the beginning of the article.
</p>

<p>
There's a high chance that <a href="https://scalameta.org/metals/">Metals</a>, or something similar, now works
flawlessly and it's easy to install. So, my recommendation is to use
it, the less configuration you have in place, the better.
</p>

<p>
By the way, this was a very cool exercise to do and it's easy to
remove because they are just a bunch of (almost) stand-alone
functions. Plus, right now they aren't perfect, but knowing that you
could change them and make them work better is reassuring.
</p>

<p>
In summary, if you want to really make a difference and improve the
state of software, don't code for your own configuration, but go and
contribute to those projects to make them better.
</p>

<p>
PS: basically, every conclusion I make at the end of my articles is
something like. Don't do what you just read!. 😄
</p>
</div>

<div id="outline-container-sec-" class="outline-4">
<h4 id="sec-">References</h4>
<div class="outline-text-4" id="text-">
<ul class="org-ul">
<li><a href="https://bitbucket.org/benkio89/.emacs.d/src/master/">Emacs configuration</a>
</li>
<li><a href="https://bitbucket.org/benkio89/.emacs.d/src/master/orgConfig/functions/languageTemplateFunctions.org">Template Functions</a>
</li>
<li><a href="https://bitbucket.org/benkio89/.emacs.d/src/master/orgConfig/functions/scala.org">Scala Functions</a>
</li>
<li><a href="https://bitbucket.org/benkio89/.emacs.d/src/master/orgConfig/functions/haskell.org">Haskell Functions</a>
</li>
<li><a href="https://bitbucket.org/benkio89/.emacs.d/src/master/orgConfig/functions/typescript.org">Typescript Functions</a>
</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-ShareButtons" class="outline-2">
<h2 id="ShareButtons"><a id="sec-" name="sec-"></a>Share Buttons</h2>
<div class="outline-text-2" id="text-ShareButtons">
<!-- AddToAny BEGIN -->
<hr>
<div class="a2a_kit a2a_kit_size_32 a2a_default_style">
<a class="a2a_dd" href="https://www.addtoany.com/share"></a>
<a class="a2a_button_facebook"></a>
<a class="a2a_button_twitter"></a>
<a class="a2a_button_whatsapp"></a>
<a class="a2a_button_telegram"></a>
<a class="a2a_button_linkedin"></a>
<a class="a2a_button_email"></a>
</div>
<script async src="https://static.addtoany.com/menu/page.js"></script>
<!-- AddToAny END -->

<script type="text/javascript">
$(function() {
  $('#text-table-of-contents > ul li').first().css("display", "none");
  $('#text-table-of-contents > ul li').last().css("display", "none");
  $('#table-of-contents').addClass("visible-lg")
});
</script>
</div>
</div>
</div></div></div>
</body>
</html>
